tiennhat2712/Smart-Garden/STM32/USER/Delay.c
#include "stm32f10x.h"
#include "CONFIG_STM32F10X.h"
#include "Delay.h"

static u8  fac_us=0;
static u16 fac_ms=0; 



void Fn_DELAY_Short (unsigned int _vrui_Time)
{
	while(_vrui_Time--);
}
void Fn_DELAY_Long  (unsigned int _vrui_Time)
{
	unsigned int vrui_i;
	while(_vrui_Time--)
	{
		for(vrui_i = 0; vrui_i < 1000; vrui_i++);
	}
}

//==============================delay===============================
void Fn_DELAY_Init (unsigned char _CLK)
{
	SysTick->CTRL&=0xfffffffb;        
	fac_us=_CLK/8;		    
	fac_ms=(u16)fac_us*1000;
}



void Fn_DELAY_ms (unsigned int _vrui_Time)
{	 		  	  		              
	u32 temp;		   
	SysTick->LOAD=(u32)_vrui_Time*fac_ms;   
	SysTick->VAL =0x00;               
	SysTick->CTRL=0x01 ;              
	do
	{
		temp=SysTick->CTRL;
	}
	while((temp&0x01)&&(!(temp&(1<<16))));
	SysTick->CTRL=0x00;               
	SysTick->VAL =0X00;                 	    
}  


void Fn_DELAY_us (unsigned long _vrui_Time)
{		
	u32 temp;	    	 
	SysTick->LOAD=_vrui_Time*fac_us;          		
	SysTick->VAL=0x00;                
	SysTick->CTRL=0x01 ;              
	do
	{
		temp=SysTick->CTRL;
	}
	while((temp&0x01)&&(!(temp&(1<<16))));
	SysTick->CTRL=0x00;               
	SysTick->VAL =0X00;               
}
